{"format":"layers-model","generatedBy":"keras v2.2.4","convertedBy":"TensorFlow.js Converter v1.1.2","modelTopology":{"keras_version":"2.2.4","backend":"tensorflow","model_config":{"class_name":"Model","config":{"name":"model_1","layers":[{"name":"input_1","class_name":"InputLayer","config":{"batch_input_shape":[null,28,28,1],"dtype":"float32","sparse":false,"name":"input_1"},"inbound_nodes":[]},{"name":"zero_padding2d_1","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_1","trainable":true,"padding":[[2,2],[2,2]],"data_format":"channels_last"},"inbound_nodes":[[["input_1",0,0,{}]]]},{"name":"conv2d_1","class_name":"Conv2D","config":{"name":"conv2d_1","trainable":true,"filters":16,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["zero_padding2d_1",0,0,{}]]]},{"name":"batch_normalization_1","class_name":"BatchNormalization","config":{"name":"batch_normalization_1","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv2d_1",0,0,{}]]]},{"name":"activation_1","class_name":"Activation","config":{"name":"activation_1","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_1",0,0,{}]]]},{"name":"depthwise_conv2d_1","class_name":"DepthwiseConv2D","config":{"name":"depthwise_conv2d_1","trainable":true,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["activation_1",0,0,{}]]]},{"name":"batch_normalization_2","class_name":"BatchNormalization","config":{"name":"batch_normalization_2","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["depthwise_conv2d_1",0,0,{}]]]},{"name":"activation_2","class_name":"Activation","config":{"name":"activation_2","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_2",0,0,{}]]]},{"name":"conv2d_2","class_name":"Conv2D","config":{"name":"conv2d_2","trainable":true,"filters":32,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_2",0,0,{}]]]},{"name":"batch_normalization_3","class_name":"BatchNormalization","config":{"name":"batch_normalization_3","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv2d_2",0,0,{}]]]},{"name":"activation_3","class_name":"Activation","config":{"name":"activation_3","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_3",0,0,{}]]]},{"name":"depthwise_conv2d_2","class_name":"DepthwiseConv2D","config":{"name":"depthwise_conv2d_2","trainable":true,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["activation_3",0,0,{}]]]},{"name":"batch_normalization_4","class_name":"BatchNormalization","config":{"name":"batch_normalization_4","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["depthwise_conv2d_2",0,0,{}]]]},{"name":"activation_4","class_name":"Activation","config":{"name":"activation_4","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_4",0,0,{}]]]},{"name":"conv2d_3","class_name":"Conv2D","config":{"name":"conv2d_3","trainable":true,"filters":64,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_4",0,0,{}]]]},{"name":"batch_normalization_5","class_name":"BatchNormalization","config":{"name":"batch_normalization_5","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv2d_3",0,0,{}]]]},{"name":"activation_5","class_name":"Activation","config":{"name":"activation_5","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_5",0,0,{}]]]},{"name":"depthwise_conv2d_3","class_name":"DepthwiseConv2D","config":{"name":"depthwise_conv2d_3","trainable":true,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["activation_5",0,0,{}]]]},{"name":"batch_normalization_6","class_name":"BatchNormalization","config":{"name":"batch_normalization_6","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["depthwise_conv2d_3",0,0,{}]]]},{"name":"activation_6","class_name":"Activation","config":{"name":"activation_6","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_6",0,0,{}]]]},{"name":"conv2d_4","class_name":"Conv2D","config":{"name":"conv2d_4","trainable":true,"filters":64,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_6",0,0,{}]]]},{"name":"batch_normalization_7","class_name":"BatchNormalization","config":{"name":"batch_normalization_7","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv2d_4",0,0,{}]]]},{"name":"activation_7","class_name":"Activation","config":{"name":"activation_7","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_7",0,0,{}]]]},{"name":"depthwise_conv2d_4","class_name":"DepthwiseConv2D","config":{"name":"depthwise_conv2d_4","trainable":true,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["activation_7",0,0,{}]]]},{"name":"batch_normalization_8","class_name":"BatchNormalization","config":{"name":"batch_normalization_8","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["depthwise_conv2d_4",0,0,{}]]]},{"name":"activation_8","class_name":"Activation","config":{"name":"activation_8","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_8",0,0,{}]]]},{"name":"conv2d_5","class_name":"Conv2D","config":{"name":"conv2d_5","trainable":true,"filters":128,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_8",0,0,{}]]]},{"name":"batch_normalization_9","class_name":"BatchNormalization","config":{"name":"batch_normalization_9","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv2d_5",0,0,{}]]]},{"name":"activation_9","class_name":"Activation","config":{"name":"activation_9","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_9",0,0,{}]]]},{"name":"depthwise_conv2d_5","class_name":"DepthwiseConv2D","config":{"name":"depthwise_conv2d_5","trainable":true,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["activation_9",0,0,{}]]]},{"name":"batch_normalization_10","class_name":"BatchNormalization","config":{"name":"batch_normalization_10","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["depthwise_conv2d_5",0,0,{}]]]},{"name":"activation_10","class_name":"Activation","config":{"name":"activation_10","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_10",0,0,{}]]]},{"name":"conv2d_6","class_name":"Conv2D","config":{"name":"conv2d_6","trainable":true,"filters":128,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_10",0,0,{}]]]},{"name":"batch_normalization_11","class_name":"BatchNormalization","config":{"name":"batch_normalization_11","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv2d_6",0,0,{}]]]},{"name":"activation_11","class_name":"Activation","config":{"name":"activation_11","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_11",0,0,{}]]]},{"name":"depthwise_conv2d_6","class_name":"DepthwiseConv2D","config":{"name":"depthwise_conv2d_6","trainable":true,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["activation_11",0,0,{}]]]},{"name":"batch_normalization_12","class_name":"BatchNormalization","config":{"name":"batch_normalization_12","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["depthwise_conv2d_6",0,0,{}]]]},{"name":"activation_12","class_name":"Activation","config":{"name":"activation_12","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_12",0,0,{}]]]},{"name":"conv2d_7","class_name":"Conv2D","config":{"name":"conv2d_7","trainable":true,"filters":256,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_12",0,0,{}]]]},{"name":"batch_normalization_13","class_name":"BatchNormalization","config":{"name":"batch_normalization_13","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv2d_7",0,0,{}]]]},{"name":"activation_13","class_name":"Activation","config":{"name":"activation_13","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_13",0,0,{}]]]},{"name":"depthwise_conv2d_7","class_name":"DepthwiseConv2D","config":{"name":"depthwise_conv2d_7","trainable":true,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["activation_13",0,0,{}]]]},{"name":"batch_normalization_14","class_name":"BatchNormalization","config":{"name":"batch_normalization_14","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["depthwise_conv2d_7",0,0,{}]]]},{"name":"activation_14","class_name":"Activation","config":{"name":"activation_14","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_14",0,0,{}]]]},{"name":"conv2d_8","class_name":"Conv2D","config":{"name":"conv2d_8","trainable":true,"filters":256,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_14",0,0,{}]]]},{"name":"batch_normalization_15","class_name":"BatchNormalization","config":{"name":"batch_normalization_15","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv2d_8",0,0,{}]]]},{"name":"activation_15","class_name":"Activation","config":{"name":"activation_15","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_15",0,0,{}]]]},{"name":"depthwise_conv2d_8","class_name":"DepthwiseConv2D","config":{"name":"depthwise_conv2d_8","trainable":true,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["activation_15",0,0,{}]]]},{"name":"batch_normalization_16","class_name":"BatchNormalization","config":{"name":"batch_normalization_16","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["depthwise_conv2d_8",0,0,{}]]]},{"name":"activation_16","class_name":"Activation","config":{"name":"activation_16","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_16",0,0,{}]]]},{"name":"conv2d_9","class_name":"Conv2D","config":{"name":"conv2d_9","trainable":true,"filters":256,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_16",0,0,{}]]]},{"name":"batch_normalization_17","class_name":"BatchNormalization","config":{"name":"batch_normalization_17","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv2d_9",0,0,{}]]]},{"name":"activation_17","class_name":"Activation","config":{"name":"activation_17","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_17",0,0,{}]]]},{"name":"depthwise_conv2d_9","class_name":"DepthwiseConv2D","config":{"name":"depthwise_conv2d_9","trainable":true,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["activation_17",0,0,{}]]]},{"name":"batch_normalization_18","class_name":"BatchNormalization","config":{"name":"batch_normalization_18","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["depthwise_conv2d_9",0,0,{}]]]},{"name":"activation_18","class_name":"Activation","config":{"name":"activation_18","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_18",0,0,{}]]]},{"name":"conv2d_10","class_name":"Conv2D","config":{"name":"conv2d_10","trainable":true,"filters":256,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_18",0,0,{}]]]},{"name":"batch_normalization_19","class_name":"BatchNormalization","config":{"name":"batch_normalization_19","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv2d_10",0,0,{}]]]},{"name":"activation_19","class_name":"Activation","config":{"name":"activation_19","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_19",0,0,{}]]]},{"name":"depthwise_conv2d_10","class_name":"DepthwiseConv2D","config":{"name":"depthwise_conv2d_10","trainable":true,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["activation_19",0,0,{}]]]},{"name":"batch_normalization_20","class_name":"BatchNormalization","config":{"name":"batch_normalization_20","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["depthwise_conv2d_10",0,0,{}]]]},{"name":"activation_20","class_name":"Activation","config":{"name":"activation_20","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_20",0,0,{}]]]},{"name":"conv2d_11","class_name":"Conv2D","config":{"name":"conv2d_11","trainable":true,"filters":256,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_20",0,0,{}]]]},{"name":"batch_normalization_21","class_name":"BatchNormalization","config":{"name":"batch_normalization_21","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv2d_11",0,0,{}]]]},{"name":"activation_21","class_name":"Activation","config":{"name":"activation_21","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_21",0,0,{}]]]},{"name":"depthwise_conv2d_11","class_name":"DepthwiseConv2D","config":{"name":"depthwise_conv2d_11","trainable":true,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["activation_21",0,0,{}]]]},{"name":"batch_normalization_22","class_name":"BatchNormalization","config":{"name":"batch_normalization_22","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["depthwise_conv2d_11",0,0,{}]]]},{"name":"activation_22","class_name":"Activation","config":{"name":"activation_22","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_22",0,0,{}]]]},{"name":"conv2d_12","class_name":"Conv2D","config":{"name":"conv2d_12","trainable":true,"filters":256,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_22",0,0,{}]]]},{"name":"batch_normalization_23","class_name":"BatchNormalization","config":{"name":"batch_normalization_23","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv2d_12",0,0,{}]]]},{"name":"activation_23","class_name":"Activation","config":{"name":"activation_23","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_23",0,0,{}]]]},{"name":"depthwise_conv2d_12","class_name":"DepthwiseConv2D","config":{"name":"depthwise_conv2d_12","trainable":true,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["activation_23",0,0,{}]]]},{"name":"batch_normalization_24","class_name":"BatchNormalization","config":{"name":"batch_normalization_24","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["depthwise_conv2d_12",0,0,{}]]]},{"name":"activation_24","class_name":"Activation","config":{"name":"activation_24","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_24",0,0,{}]]]},{"name":"conv2d_13","class_name":"Conv2D","config":{"name":"conv2d_13","trainable":true,"filters":512,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_24",0,0,{}]]]},{"name":"batch_normalization_25","class_name":"BatchNormalization","config":{"name":"batch_normalization_25","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv2d_13",0,0,{}]]]},{"name":"activation_25","class_name":"Activation","config":{"name":"activation_25","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_25",0,0,{}]]]},{"name":"depthwise_conv2d_13","class_name":"DepthwiseConv2D","config":{"name":"depthwise_conv2d_13","trainable":true,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["activation_25",0,0,{}]]]},{"name":"batch_normalization_26","class_name":"BatchNormalization","config":{"name":"batch_normalization_26","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["depthwise_conv2d_13",0,0,{}]]]},{"name":"activation_26","class_name":"Activation","config":{"name":"activation_26","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_26",0,0,{}]]]},{"name":"conv2d_14","class_name":"Conv2D","config":{"name":"conv2d_14","trainable":true,"filters":512,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["activation_26",0,0,{}]]]},{"name":"batch_normalization_27","class_name":"BatchNormalization","config":{"name":"batch_normalization_27","trainable":true,"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv2d_14",0,0,{}]]]},{"name":"activation_27","class_name":"Activation","config":{"name":"activation_27","trainable":true,"activation":"relu"},"inbound_nodes":[[["batch_normalization_27",0,0,{}]]]},{"name":"global_average_pooling2d_1","class_name":"GlobalAveragePooling2D","config":{"name":"global_average_pooling2d_1","trainable":true,"data_format":"channels_last"},"inbound_nodes":[[["activation_27",0,0,{}]]]},{"name":"dense_1","class_name":"Dense","config":{"name":"dense_1","trainable":true,"units":10,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["global_average_pooling2d_1",0,0,{}]]]},{"name":"activation_28","class_name":"Activation","config":{"name":"activation_28","trainable":true,"activation":"softmax"},"inbound_nodes":[[["dense_1",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["activation_28",0,0]]}},"training_config":{"optimizer_config":{"class_name":"Adam","config":{"lr":0.0010000000474974513,"beta_1":0.8999999761581421,"beta_2":0.9990000128746033,"decay":0.0,"epsilon":1e-07,"amsgrad":false}},"loss":"categorical_crossentropy","metrics":["accuracy"],"sample_weight_mode":null,"loss_weights":null}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"batch_normalization_1/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_1/beta","shape":[16],"dtype":"float32"},{"name":"batch_normalization_1/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_1/moving_variance","shape":[16],"dtype":"float32"},{"name":"batch_normalization_10/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_10/beta","shape":[128],"dtype":"float32"},{"name":"batch_normalization_10/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_10/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_11/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_11/beta","shape":[128],"dtype":"float32"},{"name":"batch_normalization_11/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_11/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_12/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_12/beta","shape":[128],"dtype":"float32"},{"name":"batch_normalization_12/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_12/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_13/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_13/beta","shape":[256],"dtype":"float32"},{"name":"batch_normalization_13/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_13/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_14/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_14/beta","shape":[256],"dtype":"float32"},{"name":"batch_normalization_14/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_14/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_15/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_15/beta","shape":[256],"dtype":"float32"},{"name":"batch_normalization_15/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_15/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_16/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_16/beta","shape":[256],"dtype":"float32"},{"name":"batch_normalization_16/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_16/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_17/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_17/beta","shape":[256],"dtype":"float32"},{"name":"batch_normalization_17/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_17/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_18/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_18/beta","shape":[256],"dtype":"float32"},{"name":"batch_normalization_18/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_18/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_19/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_19/beta","shape":[256],"dtype":"float32"},{"name":"batch_normalization_19/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_19/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_2/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_2/beta","shape":[16],"dtype":"float32"},{"name":"batch_normalization_2/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_2/moving_variance","shape":[16],"dtype":"float32"},{"name":"batch_normalization_20/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_20/beta","shape":[256],"dtype":"float32"},{"name":"batch_normalization_20/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_20/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_21/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_21/beta","shape":[256],"dtype":"float32"},{"name":"batch_normalization_21/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_21/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_22/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_22/beta","shape":[256],"dtype":"float32"},{"name":"batch_normalization_22/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_22/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_23/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_23/beta","shape":[256],"dtype":"float32"},{"name":"batch_normalization_23/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_23/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_24/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_24/beta","shape":[256],"dtype":"float32"},{"name":"batch_normalization_24/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_24/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_25/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_25/beta","shape":[512],"dtype":"float32"},{"name":"batch_normalization_25/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_25/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_26/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_26/beta","shape":[512],"dtype":"float32"},{"name":"batch_normalization_26/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_26/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_27/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_27/beta","shape":[512],"dtype":"float32"},{"name":"batch_normalization_27/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_27/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_3/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_3/beta","shape":[32],"dtype":"float32"},{"name":"batch_normalization_3/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_3/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_4/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_4/beta","shape":[32],"dtype":"float32"},{"name":"batch_normalization_4/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_4/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_5/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_5/beta","shape":[64],"dtype":"float32"},{"name":"batch_normalization_5/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_5/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_6/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_6/beta","shape":[64],"dtype":"float32"},{"name":"batch_normalization_6/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_6/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_7/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_7/beta","shape":[64],"dtype":"float32"},{"name":"batch_normalization_7/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_7/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_8/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_8/beta","shape":[64],"dtype":"float32"},{"name":"batch_normalization_8/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_8/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_9/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_9/beta","shape":[128],"dtype":"float32"},{"name":"batch_normalization_9/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_9/moving_variance","shape":[128],"dtype":"float32"},{"name":"conv2d_1/kernel","shape":[3,3,1,16],"dtype":"float32"},{"name":"conv2d_1/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_10/kernel","shape":[1,1,256,256],"dtype":"float32"},{"name":"conv2d_10/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_11/kernel","shape":[1,1,256,256],"dtype":"float32"},{"name":"conv2d_11/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_12/kernel","shape":[1,1,256,256],"dtype":"float32"},{"name":"conv2d_12/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_13/kernel","shape":[1,1,256,512],"dtype":"float32"},{"name":"conv2d_13/bias","shape":[512],"dtype":"float32"},{"name":"conv2d_14/kernel","shape":[1,1,512,512],"dtype":"float32"},{"name":"conv2d_14/bias","shape":[512],"dtype":"float32"},{"name":"conv2d_2/kernel","shape":[1,1,16,32],"dtype":"float32"},{"name":"conv2d_2/bias","shape":[32],"dtype":"float32"},{"name":"conv2d_3/kernel","shape":[1,1,32,64],"dtype":"float32"},{"name":"conv2d_3/bias","shape":[64],"dtype":"float32"},{"name":"conv2d_4/kernel","shape":[1,1,64,64],"dtype":"float32"},{"name":"conv2d_4/bias","shape":[64],"dtype":"float32"},{"name":"conv2d_5/kernel","shape":[1,1,64,128],"dtype":"float32"},{"name":"conv2d_5/bias","shape":[128],"dtype":"float32"},{"name":"conv2d_6/kernel","shape":[1,1,128,128],"dtype":"float32"},{"name":"conv2d_6/bias","shape":[128],"dtype":"float32"},{"name":"conv2d_7/kernel","shape":[1,1,128,256],"dtype":"float32"},{"name":"conv2d_7/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_8/kernel","shape":[1,1,256,256],"dtype":"float32"},{"name":"conv2d_8/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_9/kernel","shape":[1,1,256,256],"dtype":"float32"},{"name":"conv2d_9/bias","shape":[256],"dtype":"float32"},{"name":"dense_1/kernel","shape":[512,10],"dtype":"float32"},{"name":"dense_1/bias","shape":[10],"dtype":"float32"},{"name":"depthwise_conv2d_1/depthwise_kernel","shape":[3,3,16,1],"dtype":"float32"},{"name":"depthwise_conv2d_1/bias","shape":[16],"dtype":"float32"},{"name":"depthwise_conv2d_10/depthwise_kernel","shape":[3,3,256,1],"dtype":"float32"},{"name":"depthwise_conv2d_10/bias","shape":[256],"dtype":"float32"},{"name":"depthwise_conv2d_11/depthwise_kernel","shape":[3,3,256,1],"dtype":"float32"},{"name":"depthwise_conv2d_11/bias","shape":[256],"dtype":"float32"},{"name":"depthwise_conv2d_12/depthwise_kernel","shape":[3,3,256,1],"dtype":"float32"},{"name":"depthwise_conv2d_12/bias","shape":[256],"dtype":"float32"},{"name":"depthwise_conv2d_13/depthwise_kernel","shape":[3,3,512,1],"dtype":"float32"},{"name":"depthwise_conv2d_13/bias","shape":[512],"dtype":"float32"},{"name":"depthwise_conv2d_2/depthwise_kernel","shape":[3,3,32,1],"dtype":"float32"},{"name":"depthwise_conv2d_2/bias","shape":[32],"dtype":"float32"},{"name":"depthwise_conv2d_3/depthwise_kernel","shape":[3,3,64,1],"dtype":"float32"},{"name":"depthwise_conv2d_3/bias","shape":[64],"dtype":"float32"},{"name":"depthwise_conv2d_4/depthwise_kernel","shape":[3,3,64,1],"dtype":"float32"},